{"title": "SITUATIONAL DILEMMAS", "items": [{"q": "You’re placed in charge of a failing community project. What do you do first?", "a": [{"q": "Assess the current system’s weaknesses and begin fixing it.", "id": "Architect"}, {"q": "Share the truth of the situation as widely as possible to prompt urgency.", "id": "Herald"}, {"q": "Reaffirm the original mission and remind people why this mattered.", "id": "Keeper"}, {"q": "Protect the group from blame and outside pressure.", "id": "Shield"}, {"q": "Mediate the different voices to understand what’s really going wrong.", "id": "Synthesizer"}, {"q": "Introduce a jarring shift to break stagnation and expose blind spots.", "id": "Trickster"}, {"q": "Rebuild trust and connection before addressing logistics.", "id": "Weaver"}, {"q": "Suggest stepping away entirely to find a better path elsewhere.", "id": "Seeker"}, {"q": "Deliver a passionate call to action to reignite purpose.", "id": "Spark"}, {"q": "Observe quietly and avoid getting entangled unless absolutely necessary.", "id": "Hollow"}]}, {"q": "You’re given a powerful tool with no instructions. What do you do?", "a": [{"q": "Deconstruct it to reverse-engineer its function.", "id": "Architect"}, {"q": "Announce its discovery and speculate publicly about its use.", "id": "Herald"}, {"q": "Compare it to traditional models or historical examples.", "id": "Keeper"}, {"q": "Safeguard it — its misuse might be dangerous.", "id": "Shield"}, {"q": "Cross-reference it with other tools or ideas you've seen.", "id": "Synthesizer"}, {"q": "Try something unexpected to see how it reacts.", "id": "Trickster"}, {"q": "Ask others how it makes them feel and what they imagine it could do.", "id": "Weaver"}, {"q": "Use it impulsively — the only way to learn is to act.", "id": "Seeker"}, {"q": "Use it to provoke excitement and momentum.", "id": "Spark"}, {"q": "Set it aside — not everything needs to be used.", "id": "Hollow"}]}, {"q": "A person close to you has started to change in ways you don’t understand. How do you react?", "a": [{"q": "Try to analyze the changes rationally and quietly.", "id": "Architect"}, {"q": "Speak to them openly — they need to hear how this affects others.", "id": "Herald"}, {"q": "Reference the values or history you’ve shared to reconnect.", "id": "Keeper"}, {"q": "Stay close and offer protection, even without understanding.", "id": "Shield"}, {"q": "Try to see their changes as part of a bigger pattern.", "id": "Synthesizer"}, {"q": "Challenge their assumptions to spark honest discussion.", "id": "Trickster"}, {"q": "Show up emotionally and support them where they are.", "id": "Weaver"}, {"q": "Respect their transformation and let them evolve freely.", "id": "Seeker"}, {"q": "Respond with passion — connection is meant to be intense.", "id": "Spark"}, {"q": "Withdraw. People change. You don’t need to follow.", "id": "Hollow"}]}, {"q": "You’re invited into a high-stakes collaboration with unclear power dynamics. How do you approach it?", "a": [{"q": "Define clear roles and responsibilities early on.", "id": "Architect"}, {"q": "Ask direct questions to clarify what others may avoid saying.", "id": "Herald"}, {"q": "Honor legacy structures and let them guide your behavior.", "id": "Keeper"}, {"q": "Stay alert for signs of harm or unfair treatment and step in if needed.", "id": "Shield"}, {"q": "Study the people involved and find the common thread.", "id": "Synthesizer"}, {"q": "Challenge assumptions subtly to test people’s honesty.", "id": "Trickster"}, {"q": "Build trust through one-on-one connections before committing.", "id": "Weaver"}, {"q": "Use it as a chance to explore, not control.", "id": "Seeker"}, {"q": "Assert yourself boldly — your energy is your leverage.", "id": "Spark"}, {"q": "Remain on the fringe, involved but not invested.", "id": "Hollow"}]}, {"q": "A group you're in is spiraling into chaos. What's your natural response?", "a": [{"q": "Quietly restructure everything — clarity will stabilize it.", "id": "Architect"}, {"q": "Speak openly to cut through confusion.", "id": "Herald"}, {"q": "Remind the group of its purpose and original agreements.", "id": "Keeper"}, {"q": "Focus on grounding and protecting individuals who are overwhelmed.", "id": "Shield"}, {"q": "Map the chaos — there's a pattern inside it.", "id": "Synthesizer"}, {"q": "Amplify the chaos briefly to show what’s broken.", "id": "Trickster"}, {"q": "Soothe tensions and rebuild emotional safety.", "id": "Weaver"}, {"q": "Let the group fall — maybe it’s not meant to survive.", "id": "Seeker"}, {"q": "Take charge through sheer presence and intensity.", "id": "Spark"}, {"q": "Detach. Chaos isn’t your responsibility.", "id": "Hollow"}]}, {"q": "You discover a truth that could destabilize something important. What do you do?", "a": [{"q": "Weigh the consequences before acting.", "id": "Architect"}, {"q": "Share it — people deserve to know, even if it shakes things.", "id": "Herald"}, {"q": "Preserve the system; not all truths need telling.", "id": "Keeper"}, {"q": "Reveal it only if someone’s safety depends on it.", "id": "Shield"}, {"q": "Frame the truth carefully to integrate it without collapse.", "id": "Synthesizer"}, {"q": "Leak it in a way that forces others to confront it.", "id": "Trickster"}, {"q": "Tell those affected directly and support them through it.", "id": "Weaver"}, {"q": "Take the truth and walk — you don’t owe anyone a fight.", "id": "Seeker"}, {"q": "Turn it into a rallying cry for change.", "id": "Spark"}, {"q": "Keep it to yourself. Let the truth be your own silence.", "id": "Hollow"}]}]}